gloomyandy/RepRapFirmware/src/Hardware/STM32/Boards/FLY.h
#ifndef FLY_H
#define FLY_H

// List of assignable pins and their mapping from names to MPU ports. This is indexed by logical pin number.
// The names must match user input that has been converted to lowercase and had _ and - characters stripped out.
// Aliases are separate by the , character.
// If a pin name is prefixed by ! then this means the pin is hardware inverted. The same pin may have names for both the inverted and non-inverted cases,
// for example the inverted heater pins on the expansion connector are available as non-inverted servo pins on a DFueX.

#if STM32H7
constexpr PinEntry PinTable_FLY_SUPER5[] =
{
    //Thermistors
    {PC_4, "ADC0"},
    {PC_5, "ADC1"},
    {PB_1, "ADC2"},
	

    //Endstops
    {PB_7, "IO0"},
    {PC_7, "IO1"},
    {PC_6, "IO2"},
    {PC_13, "IO3"},
    {PC_14, "IO4"},
    {PC_15, "IO5"},
    {PB_2, "NEOPIXEL"},
 
    // Servo
    {PE_6,  "SERVO0" },

    // Probe
    {PC_2, "probe"},

    //Heaters and Fans (Big and Small Mosfets}
    {PD_12,  "heat0" },
    {PD_13,  "heat1" },
    {PB_0,  "bedout,bed" }, 
    {PA_0,  "fan0" },
    {PA_1,  "fan1" },
    {PA_2,  "fan2" },
    {PA_3,  "fan3" },

    
    //EXP1
    
    
    
    
    {PA_8, "BEEP"},    {PA_13, "BTNENC"},
    {PA_15, "LCDEN"}, {PA_14, "LCDRS"},
    {PD_0, "LCDD4"},  {PD_1, "LCDD5"},
    {PD_4, "LCDD6"},  {PD_3, "LCDD7"},
	//GND 

    //EXP2
    
    
    
    {PB_4, "LCDMISO"},{PB_3, "LCDSCK"},
    {PD_7, "BTNEN2"}, {PB_6, "LCDSS"},
    {PD_6, "BTNEN1"}, {PB_5, "LCDMOSI"},
    {PD_5, "LCDCD"},
	
	// Status LED
	{PD_15, "status"},

};

constexpr BoardDefaults fly_super5_Defaults = {
# if STM32H743xx
    {0x32757276, 0x2fe7ccfb},                   // Signatures
# elif STM32H723xx
    {0x69632a35},                               // Signatures
# endif
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 Drivers
        {PB_13, PB_14, PB_15},                  //SPI1 WiFi
        {PB_3, PB_4, PB_5},                     //SPI2 EXP
        {NoPin, NoPin, NoPin},                  //SPI3
        {NoPin, NoPin, NoPin},                  //SPI4
        {PD_0, NoPin, PA_15},                   //SPI5 for reprapdiscount display
        {NoPin, NoPin, NoPin},                  //SPI6
        {NoPin, NoPin, NoPin},                  //SPI7
        {NoPin, NoPin, NoPin},                  //SPI8
    },
    5,                                          // Number of drivers
    {PB_11, PE_13, PE_9, PC_1, PE_3, NoPin, NoPin, NoPin},    //enablePins
    {PE_14, PE_11, PE_7, PE_4, PE_1, NoPin, NoPin, NoPin},     //stepPins
    {PE_15, PE_12, PE_8, PE_5, PE_2, NoPin, NoPin, NoPin},      //dirPins
#if HAS_SMART_DRIVERS
    {PB_10, PE_10, PA_4, PC_0, PE_0, NoPin, NoPin, NoPin},    //uartPins      
     5,                                         // Smart drivers
#endif
    0,
#if HAS_VOLTAGE_MONITOR
    PC_3,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};

constexpr PinEntry PinTable_FLY_SUPER8H7[] =
{
    //Thermistors
    {PF_4, "ADC0,out0"},
    {PF_5, "ADC1,out1"},
    {PF_9, "ADC2,pwmout2,pwm2,out2"},
    {PF_10, "ADC3,out3"},
    {PC_0, "ADC4,out4"},
    {PC_1, "ADC5,out5"},
 

    //Endstops
    {PG_12, "io0"},
    {PG_11, "io1"},
    {PG_10, "io2"},
    {PG_9, "io3"},
    {PD_7, "io4"},
    {PD_6, "io5"},
    {PA_8, "io6"},
    {PF_8, "in7,pwmout1,pwm1"},
    {PF_3, "hvin"},
    // Servo
    {PC_6,  "pwmout0,pwm0,servo" },

   // Probe
    {PC_3, "probe"},

    //Heaters and Fans (Big and Small Mosfets}
    {PB_0,  "heat0" },
    {PB_1,  "heat1" },
    {PC_7,  "heat2" },
    {PF_7,  "heat3" },
    {PF_6,  "heat4" },
    {PE_5,  "bedout,bed" }, 
    {PA_0,  "fan0" },
    {PA_1,  "fan1" },
    {PA_2,  "fan2" },
    {PA_3,  "fan3" },
    {PA_15,  "fan4" },
    {PB_11,  "fan5" },
    {PB_10,  "fan6" },
    {PD_12,  "fan7" },
    {PD_14,  "fan8" },
    {PD_15,  "fan9" },
    
	// UART
	{PA_9, "TX1"},
	{PA_10, "RX1"},

    //EXP1
    {PG_13, "LCDD7"},
    {PC_13, "LCDD5"},
    {PG_8, "LCDRS"},
    {PE_13, "BTNENC"},
    {PE_12, "BEEP"},
    {PB_2, "LCDEN"},
    {PC_14, "LCDD4"},
    {PG_14, "LCDD6"},

    //EXP2
    {PG_15, "LCDCD"},
    {PB_6, "BTNEN2"},
    {PB_7, "BTNEN1"},
    {PA_6, "LCDMISO"},
    {PA_5, "LCDSCK"},
    {PA_4, "LCDSS"},
    {PA_7, "LCDMOSI"},


};

constexpr BoardDefaults fly_super8h7_Defaults = {
# if STM32H743xx
    {0x32757276},                               // Signatures
# elif STM32H723xx
    {0x69632a35},                               // Signatures
#endif
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 EXP
        {PB_13, PB_14, PB_15},                  //SPI1 WiFi
        {PB_3, PB_4, PB_5},                     //SPI2 Drivers
        {PD_3, PD_4, PD_5},                     //SPI3 Accelerometer Header
        {NoPin, NoPin, NoPin},                  //SPI4
        {PC_14, NoPin, PB_2},                   //SPI5 for Reprapdiscount display
        {NoPin, NoPin, NoPin},                  //SPI6
        {NoPin, NoPin, NoPin},                  //SPI7
        {NoPin, NoPin, NoPin},                  //SPI8

    },
	8,											// Number of drivers
    {PF_11, PF_14, PG_1, PE_9, PF_2, PC_15, PG_4, PG_7},   	//enablePins
    {PE_2, PE_3, PE_4, PE_14, PE_15, PE_1, PE_0, PE_6},	    //stepPins
    {PC_5, PF_13, PG_0, PE_8, PE_11, PF_0, PG_3, PG_6},    	//dirPins
#if HAS_SMART_DRIVERS
    {PC_4, PF_12, PF_15, PE_7, PE_10, PF_1, PG_2, PG_5},      //uartPins      
	 8,                                       	// Smart drivers
#endif
    0,
#if HAS_VOLTAGE_MONITOR
    PC_2,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};

# if STM32H723xx
constexpr PinEntry PinTable_FLY_OPENPNP_TOOL[] =
{

    //Thermistors
    {PC_6, "chamber"},

    //Endstops
    {PB_10, "io0"},
    {PC_3, "io1"},
    {PC_4, "io2"},
    {PD_14, "diag0"},
    {PE_7, "diag1"},
    {PE_12, "diag2"},

    // RGB
    {PE_14, "rgb"},

    //Heaters and Fans (Big and Small Mosfets}
    {PA_3,  "fan0,fan"   },
    {PA_2,  "fan1"      },
    {PA_1,  "fan2"      },
    {PA_0,  "fan3"      },


    //SD
    {PC_9, "SDD1"   },
    {PC_8, "SDD0"   },
    {PC_12, "SDSCK" },
    {PD_2, "SDCMD"  },
    {PC_11, "SDD3"  },
    {PC_10, "SDD2"  },
	
	// Status LED
	{PA_15, "status"},


