gloomyandy/RepRapFirmware/src/Hardware/STM32/Boards/FLY.h
};

constexpr BoardDefaults fly_openpnp_tool_Defaults = {
    {0x69632a35, 0x8a5f5551, 0xd0c680ae},       // Signatures
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {NoPin, NoPin, NoPin},                  //SPI0 
        {PB_13, PB_14, PB_15},                  //SPI1 Accelerometer
        {NoPin, NoPin, NoPin},                  //SPI2 
        {NoPin, NoPin, NoPin},                  //SPI3 
        {NoPin, NoPin, NoPin},                  //SPI4 
        {NoPin, NoPin, NoPin},                  //SPI5
    },
    3,                                            // Number of drivers
    {PD_15, PE_8, PE_13, NoPin },           //enablePins
    {PD_12, PB_0, PE_10, NoPin},        //stepPins
    {PD_11, PC_5, PE_9, NoPin},        //dirPins
#if HAS_SMART_DRIVERS
    {PD_13, PB_1, PE_11, NoPin},
     3,                                      //uartPins                                              // Smart drivers
#endif
    0,
#if HAS_VOLTAGE_MONITOR
    PC_7,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};
# endif
#endif

#if STM32F4

constexpr PinEntry PinTable_FLY_F407ZG[] =
{
    //Thermistors
    {PA_0, "e0temp,t0"},
    {PC_1, "e1temp,t1"},
    {PC_0, "e2temp,t2"},
    {PF_10, "e3temp,t3"},
    {PF_5, "e4temp,t4"},
    {PF_4, "e5temp,t5"},
    {PF_3, "bedtemp,tb"},

    //Endstops
    {PC_3, "xmin,xstop"},
    {PC_2, "xmax,xstopmax"},
    {PF_2, "ymin,ystop"},
    {PF_1, "ymax,ystopmax"},
    {PF_0, "zmin,zstop"},
    {PC_15, "zmax,zstopmax"},
    {PC_14, "z3"},
    {PA_3, "dljc"},
    
    //Heaters and Fans (Big and Small Mosfets}
    {PE_2,  "bed,hbed" },
    {PF_7,  "e0heat,he0" },
    {PF_6,  "e1heat,he1" },
    {PE_6,  "e2heat,he2" },
    {PE_5,  "e3heat,he3" },
    {PE_4,  "e4heat,he4" },
    {PE_3,  "e5heat,he5" },
    
    {PF_8,  "fan0,fan" },
    {PF_9,  "fan1" },
    {PA_2,  "fan2" },
    {PA_1,  "fan3" },
    {PE_13,  "fan4" },
    {PB_11,  "fan5" },

    // Servo
    {PE_11,  "servo0" },

    //EXP1
    {PB_10, "BEEP"},
    {PE_14, "LCDEN"},
    {PE_10, "LCDD4"},
    {PE_8, "LCDD6"},
    {PE_15, "BTNENC"},
    {PE_12, "LCDRS"},
    {PE_9, "LCDD5"},
    {PE_7, "LCDD7"},

    //EXP2
    {PB_14, "LCDMISO"},
    {PB_13, "LCDSCK"},
    {PC_5, "BTNEN1"},
    {PC_4, "BTNEN2"},
    {PF_11, "LCDSS"},
    {PB_15, "LCDMOSI"},
    {PB_2, "LCDCD"},

    //SD
    {PC_13, "SDCD"},
    {PC_9, "SDD1"},
    {PC_8, "SDD0"},
    {PC_12, "SDSCK"},
    {PD_2, "SDCMD"},
    {PC_11, "SDD3"},
    {PC_10, "SDD2"},
 
    // UART
    {PA_9, "TX1"},
    {PA_10, "RX1"},
};

constexpr BoardDefaults fly_f407zg_Defaults = {
    {0x8a5f5551, 0xd0c680ae},                   // Signatures
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 MAX6675
        {PB_13, PB_14, PB_15},                  //SPI1 on EXP and Mot Drivers
        {PB_3, PB_4, PB_5},                     //SPI2 On the ESP Pads
        {PE_10, NoPin, PE_14},                  //SPI3
        {NoPin, NoPin, NoPin},                  //SPI4
        {PE_8, PE_10, PE_7},                    //SPI5 accelerometer
    },
    9,                                          // Number of drivers
    {PE_1, PG_12,  PD_7, PD_4,  PD_0, PG_8, PG_5, PG_2, PD_9},      //enablePins
    {PB_9, PB_8, PA_8, PC_7,  PC_6, PD_15, PD_14, PD_13, PD_12},    //stepPins
    {PE_0, PG_11, PD_6, PD_3,  PA_15, PG_7, PG_4, PD_11, PD_8},     //dirPins
#if HAS_SMART_DRIVERS
    {PG_13, PG_10, PD_5, PD_1,
#if STARTUP_DELAY
    // Avoid clash with jtag pins
    NoPin,
#else
    PA_14,
#endif
     PG_6, PG_3, PD_10, PB_12},                 //uartPins
    9,                                          // Smart drivers
#endif
    0,                                          //digiPot Factor
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    PB_2, PF_11, SSP2,
#endif
};


constexpr PinEntry PinTable_FLY_E3[] =
{
    //Thermistors
    {PA_4, "e0temp,t0"},
    {PA_3, "bedtemp,tb"},

    //Endstops
    {PA_2, "xmin,xstop"},
    {PA_1, "ymin,ystop"},
    {PC_5, "zmin,zstop"},

    // Servo
    {PB_0,  "servo0" },

   // Porbe
    {PC_4, "probe"},
    
    //Heaters and Fans (Big and Small Mosfets}
    {PA_0,  "bed,hbed" },
    {PA_5,  "e0heat,he0" },
    {PA_7,  "fan0,fan" },
    {PA_6,  "fan1" },

    //EXP1
    {PE_12, "BEEP"},
    {PE_11, "BTNENC"},
    {PE_10, "LCDEN"},
    {PE_9, "LCDD4"},
    {PE_8, "LCDD5"},
    {PE_7, "LCDD6"},
    {PB_1, "LCDD7"},

    //SD
    {PA_15, "SDCD"},
    {PC_9, "SDD1"},
    {PC_8, "SDD0"},
    {PC_12, "SDSCK"},
    {PD_2, "SDCMD"},
    {PC_11, "SDD3"},
    {PC_10, "SDD2"},

    //FPC
    {PB_10, "FPC1"},
    {PB_11, "FPC2"},
    {PD_10, "FPC3"},
    {PD_11, "FPC4"},
    {PD_12, "FPC5"},
    {PD_13, "FPC6"},
    {PD_14, "FPC7"},
    {PD_15, "FPC8"},
    {PC_6, "FPC9"},
    {PD_0, "FPC10"},
    {PD_1, "FPC11"},
	
	// Status LED
	{PA_8, "status"},

};

constexpr BoardDefaults fly_e3_Defaults = {
    {0xd0c680ae, 0xfd2146b0},                   // Signatures
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {NoPin, NoPin, NoPin},                  //SPI0
        {PB_13, PB_14, PB_15},                  //SPI1 WiFi
        {NoPin, NoPin, NoPin},                  //SPI2
        {PC_2, PC_0, PC_1},                     //SPI3 MAX31865 and MAX6675
        {PE_8, NoPin, PB_1},                    //SPI4 Ender Screen
        {PE_7, PE_10, PE_9},                    //SPI5 Accelerometer
    },
    4,                                          // Number of drivers
    {PC_15, PE_5, PE_1, PB_5},                  //enablePins
    {PC_13, PE_3, PB_9, PB_3},                  //stepPins
    {PC_14, PE_4, PE_0, PB_4},                  //dirPins
#if HAS_SMART_DRIVERS
    {PE_6, PE_2, PB_8, PD_7},                   //uartPins            
    4,                                          // Smart drivers
#endif
    0, 
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};


constexpr PinEntry PinTable_FLY_CDYV2[] =
{
    //Thermistors
    {PA_3, "e0temp,t0"},
    {PC_4, "e1temp,t1"},
    {PC_5, "e2temp,t2"},
    {PB_1, "bedtemp,tb"},

    //Endstops
    {PC_7, "xmin,xstop"},
    {PC_6, "xmax,xstopmax"},
    {PD_11, "ymin,ystop"},
    {PD_10, "ymax,ystopmax"},
    {PB_10, "zmin,zstop"},
    {PB_11, "zmax,zstopmax"},

    // Servo
    {PE_6,  "servo0" },

    // Probe
    {PC_2, "probe"},
    
    //Heaters and Fans (Big and Small Mosfets}
    {PB_0,  "bed,hbed" },
    {PD_12,  "e0heat,he0" },
    {PD_13,  "e1heat,he1" },
    {PD_14,  "e2heat,he2" },
    {PA_0,  "fan0,fan" },
    {PA_1,  "fan1" },
    {PA_2,  "fan2" },

