gloomyandy/RepRapFirmware/src/Hardware/STM32/Boards/FLY.h
    //EXP1
    {PA_14, "LCDD7"},
    {PA_13, "LCDD6"},
    {PE_15, "LCDD4"},
    {PE_14, "LCDD5"},
    {PB_2, "LCDEN"},
    {PE_13, "LCDCD"},

    // UART
    {PA_9, "TX1,BTNENC"},
    {PA_10, "RX1,LCDRS"},

    // WIFI UART
    {PD_8, "BTNEN1"},
    {PD_9, "BTNEN2"},

    //spi 1  (SD,MAX31865,MAX6675)
    {PA_4, "SPI1SDCS,LCDSS"},
    {PA_5, "SPI1SCK,LCDSCK"},
    {PA_6, "SPI1MISO,LCDMISO"},
    {PA_7, "SPI1MOSI,LCDMOSI"},
    {PE_7, "SPI1CS1"},
    {PE_8, "SPI1CS2"},

    //spi 3  (MOT TMC2130 TMC5160)
    {PB_3, "MOTSCK"},
    {PB_4, "MOTMISO"},
    {PB_5, "MOTMOSI"},

    //Signal light   Neopixel
    {PD_15, "status,neopixel"},

    //Laser 
    {PB_9, "Laser"},
    
    //Power ADC
    {PC_3, "PowerADC"}
};

constexpr BoardDefaults fly_cdyv2_Defaults = {
    {0x8a5f5551, 0xd0c680ae},                   // Signatures
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 EXP
        {PB_13, PB_14, PB_15},                  //SPI1 WiFi
        {PB_3, PB_4, PB_5},                     //SPI2 Drivers
        {PE_15, NoPin, PB_2},                   //SPI3 Screens
        {NoPin, NoPin, NoPin},                  //SPI4
        {PA_13, PE_15, PA_14},                  //SPI5 Accelerometer
    },
    6,                                          // Number of drivers
    {PC_1, PC_14, PB_8, PD_7, PD_4, PD_0},      //enablePins
    {PE_5, PE_4, PE_3, PE_2, PE_1, PE_0},       //stepPins
    {PC_0, PC_13, PB_7, PD_6, PD_3, PA_15},     //dirPins
#if HAS_SMART_DRIVERS
    {PC_15, PA_8, PB_6, PD_5, PD_1, PE_9},      //uartPins      
     6,                                         // Smart drivers
#endif
    0,
#if HAS_VOLTAGE_MONITOR
    PC_3,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};

constexpr PinEntry PinTable_FLY_E3_PRO[] =
{

    //Thermistors
    {PA_4, "e0temp,t0"},
    {PA_1, "e1temp,t1"},
    {PA_3, "bedtemp,tb"},
    {PC_1, "boardtemp,tboard"},
    //Endstops
    {PA_2, "xmin,xstop"},
    {PB_10, "ymin,ystop"},
    {PC_4, "zmin,zstop"},
    {PD_0, "e0min,e0stop"},
    {PD_1, "e1min,e1stop"},
    // Servo
    {PB_0,  "servo0" },

   // Porbe
    {PC_5, "probe"},
    
    //Heaters and Fans (Big and Small Mosfets}
    {PA_0,  "bed,hbed" },
    {PA_5,  "e0heat,he0" },
    {PC_6,  "e1heat,he1" },
    {PA_7,  "fan0,fan" },
    {PA_6,  "fan1" },
    {PB_6,  "fan2" },
    {PB_7,  "fan3" },

    //EXP1
    {PE_12, "BEEP"},
    {PE_11, "BTNENC"},
    {PE_10, "LCDEN"},
    {PE_9, "LCDD4"},
    {PE_8, "LCDD5"},
    {PE_7, "LCDD6"},
    {PB_1, "LCDD7"},

    //SD
    {PC_9, "SDD1"},
    {PC_8, "SDD0"},
    {PC_12, "SDSCK"},
    {PD_2, "SDCMD"},
    {PC_11, "SDD3"},
    {PC_10, "SDD2"},

    // UART
    {PA_9, "TX1"},
    {PA_10, "RX1"},

    //Signal light
     {PA_8, "status"},

    //FPC
    {PB_11, "neopixel"},
    {PD_11, "PSON"},
    {PE_6, "laser"},
    {PC_3, "PowerADC"},
    {PD_10, "pwr, PWRDET"},

};

constexpr BoardDefaults fly_e3_pro_Defaults = {
    {0xd0c680ae},                   // Signatures
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {NoPin, NoPin, NoPin},                  //SPI0 
        {PB_13, PB_14, PB_15},                  //SPI1 WiFi
        {NoPin, NoPin, NoPin},                  //SPI2
        {PD_14, PD_12, PD_13},                  //SPI3 MAX31865 and MAX31855
        {PE_8, NoPin, PB_1},                    //SPI4 Single Wire Screen
        {PE_7, PE_10, PE_9},                    //SPI5 Accelerometer
    },
    5,                                          // Number of drivers
    {PE_5, PE_1, PB_5, PD_6 ,PC_15},            //enablePins
    {PE_3, PB_9, PB_3, PD_4, PC_13},            //stepPins
    {PE_2, PB_8, PD_7, PD_3, PC_0 },            //dirPins
#if HAS_SMART_DRIVERS
    {PE_4, PE_0, PB_4, PD_5, PC_14},            // uartPins 
     5,                                         // Smart drivers
#endif
    0,  
#if HAS_VOLTAGE_MONITOR
    PC_3,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};

constexpr PinEntry PinTable_FLY_SUPER8[] =
{
    //Thermistors
    {PF_4, "ADC0,out0"},
    {PF_5, "ADC1,out1"},
    {PF_9, "ADC2,pwmout2,pwm2,out2"},
    {PF_10, "ADC3,out3"},
    {PC_0, "ADC4,out4"},
    {PC_1, "ADC5,out5"},
 
    //Endstops
    {PG_12, "io0"},
    {PG_11, "io1"},
    {PG_10, "io2"},
    {PG_9, "io3"},
    {PD_7, "io4"},
    {PD_6, "io5"},
    {PA_8, "io6"},
    {PF_8, "in7,pwmout1,pwm1"},
    {PF_3, "hvin"},
    // Servo
    {PC_6,  "pwmout0,pwm0,servo" },

    // Probe
    {PC_3, "probe"},

    //Heaters and Fans (Big and Small Mosfets}
    {PB_0,  "heat0" },
    {PB_1,  "heat1" },
    {PC_7,  "heat2" },
    {PF_7,  "heat3" },
    {PF_6,  "heat4" },
    {PE_5,  "bedout,bed" }, 
    {PA_0,  "fan0" },
    {PA_1,  "fan1" },
    {PA_2,  "fan2" },
    {PA_3,  "fan3" },
    {PA_15,  "fan4" },
    {PB_11,  "fan5" },
    {PB_10,  "fan6" },
    {PD_12,  "fan7" },
    {PD_14,  "fan8" },
    {PD_15,  "fan9" },
    
    //EXP1
    {PG_13, "LCDD7"},
    {PC_13, "LCDD5"},
    {PG_8, "LCDRS"},
    {PE_13, "BTNENC"},
    {PE_12, "BEEP"},
    {PB_2, "LCDEN"},
    {PC_14, "LCDD4"},
    {PG_14, "LCDD6"},

    //EXP2
    {PG_15, "LCDCD"},
    {PB_6, "BTNEN2"},
    {PB_7, "BTNEN1"},
    {PA_6, "LCDMISO"},
    {PA_5, "LCDSCK"},
    {PA_4, "LCDSS"},
    {PA_7, "LCDMOSI"},

};

constexpr BoardDefaults fly_super8_Defaults = {
    {0x8a5f5551, 0xd0c680ae},                   // Signatures
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 EXP
        {PB_13, PB_14, PB_15},                  //SPI1 WiFi
        {PB_3, PB_4, PB_5},                     //SPI2 Drivers
        {PD_3, PD_4, PD_5},                     //SPI3 Accelerometer
        {NoPin, NoPin, NoPin},                  //SPI4
        {PC_14, NoPin, PB_2},                   //SPI5 Reprapdiscount Display
    },
    8,                                          // Number of drivers
    {PF_11, PF_14, PG_1, PE_9, PF_2, PC_15, PG_4, PG_7},    //enablePins
    {PE_2, PE_3, PE_4, PE_14, PE_15, PE_1, PE_0, PE_6},     //stepPins
    {PC_5, PF_13, PG_0, PE_8, PE_11, PF_0, PG_3, PG_6},     //dirPins
#if HAS_SMART_DRIVERS
    {PC_4, PF_12, PF_15, PE_7, PE_10, PF_1, PG_2, PG_5},    //uartPins      
     8,                                         // Smart drivers
#endif
    0,
#if HAS_VOLTAGE_MONITOR
    PC_2,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};

constexpr PinEntry PinTable_FLY_E3_PROV3[] =
{

    //Thermistors
    {PA_4, "e0temp,t0"},
    {PA_1, "e1temp,t1"},
    {PA_3, "bedtemp,tb"},
    {PC_1, "boardtemp,tboard"},
    
    //Endstops
    {PA_2, "xmin,xstop"},
    {PB_10, "ymin,ystop"},
    {PC_4, "zmin,zstop"},
    {PD_0, "e0min,e0stop"},
    {PD_1, "e1min,e1stop"},
    
    // Servo
    {PB_0,  "servo0" },

    // Porbe
    {PC_5, "probe"},
    
    //Heaters and Fans (Big and Small Mosfets}
    {PA_0,  "bed,hbed" },
    {PA_5,  "e0heat,he0" },
    {PC_6,  "e1heat,he1" },
    {PA_7,  "fan0,fan" },
    {PA_6,  "fan1" },
    {PB_6,  "fan2" },
    {PB_7,  "fan3" },

