gloomyandy/RepRapFirmware/src/Hardware/STM32/Boards/FLY.h
    //EXP1
    {PE_11, "BEEP"},
    {PE_12, "BTNENC"},
    {PE_10, "LCDD5"},
    {PE_6, "LCDRS"},
    {PE_8, "LCDD7"},
    {PA_14, "LCDEN"},
    {PE_9, "LCDD4"},
    {PE_7, "LCDD6"},
    
    //EXP2
    {PA_13, "LCDCD"},
    {PB_4, "LCDMISO"},
    {PB_3, "LCDSCK"},
    {PB_2, "LCDSS"},
    {PB_5, "LCDMOSI"},

    //SD
    {PC_9, "SDD1"},
    {PC_8, "SDD0"},
    {PC_12, "SDSCK"},
    {PD_2, "SDCMD"},
    {PC_11, "SDD3"},
    {PC_10, "SDD2"},

    // UART
    {PA_9, "TX1,BTNEN2"},
    {PA_10, "RX1,BTNEN1"},

    //FPC
    {PB_11, "neopixel"},
    {PD_11, "PSON"},
    {PB_1, "laser"},
    {PD_10, "pwr, PWRDET"},

};

constexpr BoardDefaults fly_e3_prov3_Defaults = {
    {0xd0c680ae},                   // Signatures
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {NoPin, NoPin, NoPin},                  //SPI0
        {PB_13, PB_14, PB_15},                  //SPI1 Wifi module
        {PB_3, PB_4, PB_5},                     //SPI2 used for Fysetc dual wire display
        {PD_14, PD_12, PD_13},                  //SPI3 MAX31855 and MAX31865
        {PE_10, NoPin, PE_8},                   //SPI4 used for single wire ender displays
        {PE_9, NoPin, PA_14},                   //SPI5 Reprapdiscount Display
    },
    5,                                            // Number of drivers
    {PE_5, PE_1, PC_2, PD_6 ,PC_15},           //enablePins
    {PE_3, PB_9, PA_15, PD_4, PC_13},        //stepPins
    {PE_2, PB_8, PD_7, PD_3, PC_0 },        //dirPins
#if HAS_SMART_DRIVERS
    {PE_4, PE_0, PA_8, PD_5, PC_14},           
     5,                                      //uartPins                                              // Smart drivers
#endif
    0,  
#if HAS_VOLTAGE_MONITOR
    PC_3,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};

#if HAS_SBC_INTERFACE
constexpr PinEntry PinTable_FLY_GEMINI[] =
{
    //Thermistors
    {PC_0, "e0temp,t0"},
    {PC_2, "bedtemp,tb"},
 
    //Endstops
    {PA_3, "xstop"},
    {PB_1, "ystop"},
    {PB_10, "zstop"},

    // Servo
    {PB_0,  "servo0" },

    // Porbe
    {PA_1, "probe"},

    //Heaters and Fans (Big and Small Mosfets}
    {PA_2,  "bed,hbed" },
    {PA_0,  "e0heat,he0" },
    {PC_6,  "fan0,fan" },

    //SD
    {PC_9, "SDD1"},
    {PC_8, "SDD0"},
    {PC_12, "SDSCK"},
    {PD_2, "SDCMD"},
    {PC_11, "SDD3"},
    {PC_10, "SDD2"},

    // UART
    {PA_9, "TX1,LCDD4"},
    {PA_10, "RX1,LCDRS"},
    
    //EXP1
    {PA_8, "LCDD5"},
    {PA_4, "BTNENC"},
    {PA_13, "LCDEN"},
    
    //EXP2
    {PB_3, "LCDCD"},
    {PA_14, "BTNEN2"},
    {PA_15, "BTNEN1"},
    {PB_14, "LCDMISO"},
    {PB_13, "LCDSCK"},
    {PB_12, "LCDSS"},
    {PB_15, "LCDMOSI"},

};

constexpr BoardDefaults fly_gemini_Defaults = {
    {0xbfecc997},                       // Signatures
    SD_SDIO,                            // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 Drivers
        {PB_13, PB_14, PB_15},                  //SPI1 SBC
        {NoPin, NoPin, NoPin},                  //SPI2
        {NoPin, NoPin, NoPin},                  //SPI3
        {NoPin, NoPin, NoPin},                  //SPI4
        {NoPin, NoPin, NoPin},                  //SPI5
    },
    4,                                            // Number of drivers
    {PB_2, PB_6, PB_5, PB_4},           //enablePins
    {PC_13, PC_14, PC_15, PC_3},        //stepPins
    {PC_1, PC_4, PC_5, PC_7},           //dirPins
#if HAS_SMART_DRIVERS
    {PB_11, PB_9, PB_8, PB_7},
     4,                                      //uartPins                                              // Smart drivers
#endif
    0,
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    PB_3, PB_12, SSP2,
#endif
};

constexpr PinEntry PinTable_FLY_GEMINI_V1_1[] =
{
    //Thermistors
    {PC_0, "e0temp,t0"},
    {PC_2, "bedtemp,tb"},
 
    //Endstops
    {PA_3, "xstop"},
    {PB_1, "ystop"},
    {PB_10, "zstop"},

    // Servo
    {PB_0,  "servo0" },

    // Porbe
    {PA_1, "probe"},

    //Heaters and Fans (Big and Small Mosfets}
    {PA_2,  "bed,hbed" },
    {PA_0,  "e0heat,he0" },
    {PC_6,  "fan0,fan" },
    {PC_7,  "fan1" },

    // UART
    {PA_9, "TX1,LCDD4"},
    {PA_10, "RX1,LCDRS"},

    //EXP1
    {PA_8, "LCDD5"},
    {PA_4, "BTNENC"},
    {PA_13, "LCDEN"},
    
    //EXP2
    {PB_3, "LCDCD"},
    {PA_14, "BTNEN2"},
    {PA_15, "BTNEN1"},
    {PB_14, "LCDMISO"},
    {PB_13, "LCDSCK"},
    {PB_12, "LCDSS"},
    {PB_15, "LCDMOSI"},

};

constexpr BoardDefaults fly_gemini_v1_1_Defaults = {
    {0x318f4fbe},                         // Signatures
    SD_SPI1_B,                            // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0
        {PB_13, PB_14, PB_15},                  //SPI1 SBC
        {PB_3, PB_4, PB_5},                     //SPI2 Drivers
        {NoPin, NoPin, NoPin},                  //SPI3
        {NoPin, NoPin, NoPin},                  //SPI4
        {NoPin, NoPin, NoPin},                  //SPI5
    },
    4,                                          // Number of drivers
    {PB_2, PD_2, PC_12, PC_11},                   //enablePins
    {PC_13, PC_14, PC_15, PC_3},                //stepPins
    {PC_1, PC_4, PC_5, PC_8},                   //dirPins
#if HAS_SMART_DRIVERS
    {PB_11, PB_9, PB_8, PB_7},
     4,                                         //uartPins                                              // Smart drivers
#endif
    0,
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    PB_3, PB_12, SSP2,
#endif
};

constexpr PinEntry PinTable_FLY_GEMINI_V2_0[] =
{
    //Thermistors
    {PC_0, "e0temp,t0"},
    {PC_2, "bedtemp,tb"},
 
    //Endstops
    {PA_3, "xstop"},
    {PB_1, "ystop"},
    {PB_10, "zstop"},

    // Servo
    {PB_0,  "servo0" },

    // Porbe
    {PA_1, "probe"},

    //Heaters and Fans (Big and Small Mosfets)
    {PA_2,  "bed,hbed" },
    {PA_0,  "e0heat,he0" },
    {PC_6,  "fan0,fan" },
    {PC_7,  "fan1" },

