gloomyandy/RepRapFirmware/src/Hardware/STM32/Boards/FLY.h
    // UART
    {PA_9, "TX1,LCDD4"},
    {PA_10, "RX1,LCDRS"},

    //EXP1
    {PA_8, "LCDD5"},
    {PB_6, "BTNENC"},
    {PA_13, "LCDEN"},
    {PA_9, "LCDD4"},

    
    //EXP2
    {PC_10, "LCDCD"},
    {PA_14, "BTNEN1"},
    {PA_15, "BTNEN2"},
    {PB_14, "LCDMISO"},
    {PB_13, "LCDSCK"},
    {PB_12, "LCDSS"},
    {PB_15, "LCDMOSI"},

};

constexpr BoardDefaults fly_gemini_v2_0_Defaults = {
    {0x318f4fbe},                         // Signatures
    SD_SPI1_B,                            // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 
        {PB_13, PB_14, PB_15},                  //SPI1 SBC
        {PB_3, PB_4, PB_5},                     //SPI2 Drivers
        {NoPin, NoPin, NoPin},                  //SPI3
        {NoPin, NoPin, NoPin},                  //SPI4
        {NoPin, NoPin, NoPin},                  //SPI5
    },
    4,                                          // Number of drivers
    {PB_2, PD_2, PC_12, PC_11},                   //enablePins
    {PC_13, PC_14, PC_15, PC_3},                //stepPins
    {PC_1, PC_4, PC_5, PC_8},                   //dirPins
#if HAS_SMART_DRIVERS
    {PB_11, PB_9, PB_8, PB_7},
     4,                                         //uartPins                                              // Smart drivers
#endif
    0,
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    PB_3, PB_12, SSP2,
#endif
};

constexpr PinEntry PinTable_FLY_GEMINI_V3_0[] =
{
    //Thermistors
    {PC_0, "e0temp,t0"},
    {PC_2, "bedtemp,tb"},
 
    //Endstops
    {PA_4, "xstop"},
    {PA_5, "ystop"},
    {PA_6, "zstop"},
    {PB_1, "e0stop"},

    // Servo
    {PB_0,  "servo0" },

    // Porbe
    {PA_1, "probe"},

    //Heaters and Fans (Big and Small Mosfets)
    {PA_2,  "bed,hbed" },
    {PA_0,  "e0heat,he0" },
    {PC_6,  "fan0,fan" },
    {PC_7,  "fan1" },

    //EXP1
    {PA_8, "LCDD5"},
    {PB_10, "BTNENC"},
    {PA_13, "LCDEN"},
    {PA_9, "LCDD4"},
    {PA_10, "LCDRS"},

    
    //EXP2
    {PA_7, "LCDCD"},
    {PA_14, "BTNEN1"},
    {PA_15, "BTNEN2"},
    {PB_14, "LCDMISO"},
    {PB_13, "LCDSCK"},
    {PB_12, "LCDSS"},
    {PB_15, "LCDMOSI"},

};

constexpr BoardDefaults fly_gemini_v3_0_Defaults = {
    {0xa409fa9},                         // Signatures
    SD_NONE,                             // SD Card access, no sd card
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 
        {PB_13, PB_14, PB_15},                  //SPI1 SBC
        {PB_3, PB_4, PB_5},                     //SPI2 Drivers
        {NoPin, NoPin, NoPin},                  //SPI3
        {NoPin, NoPin, NoPin},                  //SPI4
        {NoPin, NoPin, NoPin},                  //SPI5
    },
    4,                                          // Number of drivers
    {PA_3, PD_2, PC_12, PC_11},                   //enablePins
    {PC_13, PC_14, PC_15, PC_3},                //stepPins
    {PC_1, PC_4, PC_5, PC_8},                   //dirPins
#if HAS_SMART_DRIVERS
    {PB_11, PC_10, PB_7, PB_6},
     4,                                         //uartPins                                              // Smart drivers
#endif
    0,
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    PC_9, PB_12, SSP2,
#endif
};
#endif

constexpr PinEntry PinTable_FLY_E3_V2[] =
{

    //Thermistors
    {PC_4, "e0temp,t0"},
    {PC_5, "e1temp,t1"},
    {PB_1, "bedtemp,tb"},
 
    
    //Endstops
    {PE_7, "xmin,xstop"},
    {PE_8, "ymin,ystop"},
    {PE_9, "zmin,zstop"},

    
    // Servo
    {PE_6,  "servo0" },

    // Porbe
    {PC_2, "probe"},
    
    //Heaters and Fans (Big and Small Mosfets}
    {PB_0,  "bed,hbed"   },
    {PC_6,  "e0heat,he0" },
    {PC_7,  "e1heat,he1" },
    {PA_0,  "fan0,fan"   },
    {PA_1,  "fan1"      },
    {PA_2,  "fan2"      },
    {PA_3,  "fan3"      },

    //EXP1
    {PD_10,  "BEEP"  },    {PA_9,   "TX1,BTNENC" },
    {PA_8,   "LCDEN" },    {PA_10,  "RX1,LCDRS"  },
    {PE_14,  "LCDD5" },    {PE_15,  "LCDD4"      },
    {PA_14,  "LCDD6" },    {PA_13,  "LCDD7"      },
    
    
    //EXP2
    {PA_6,   "LCDMISO"},     {PA_5,  "LCDSCK"  },
    {PB_11,  "BTNEN2" },     {PA_4,  "LCDSS"   },
    {PB_10,  "BTNEN1" },     {PA_7,  "LCDMOSI" },
    {PE_13,  "TFCD,LCDCD"   },


    //SD
    {PC_9, "SDD1"   },
    {PC_8, "SDD0"   },
    {PC_12, "SDSCK" },
    {PD_2, "SDCMD"  },
    {PC_11, "SDD3"  },
    {PC_10, "SDD2"  },
	
	// Status LED
	{PA_15, "status"},


};

constexpr BoardDefaults fly_e3_v2_Defaults = {
    {0xd0c680ae},                   // Signatures
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 EXP SD
        {PB_13, PB_14, PB_15},                  //SPI1 Wifi module
        {PB_3, PB_4, PB_5},                     //SPI2 MOT
        {PD_12, PD_13, PD_11},                  //SPI3 MAX31855 MAX31865
        {PE_14, NoPin, PA_13},                  //SPI4 used for single wire ender displays
        {PE_15, NoPin, PA_8},                   //SPI5 Reprapdiscount Display
    },
    5,                                            // Number of drivers
    {PC_1, PC_14, PE_3, PD_6 ,PD_3},           //enablePins
    {PE_5, PE_4, PE_1, PE_2, PE_0},        //stepPins
    {PC_0, PC_13, PB_7, PD_5, PD_1 },        //dirPins
#if HAS_SMART_DRIVERS
    {PC_15, PB_6, PD_7, PD_4, PD_0},           
     5,                                      //uartPins                                              // Smart drivers
#endif
    0,  
#if HAS_VOLTAGE_MONITOR
    PC_3,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};

#endif
#endif
